### Data Cleaning Techniques

Data cleaning is an essential part of any data science project. It involves transforming raw data into a format that is more appropriate for analysis by addressing issues such as missing values, incorrect data, duplicate records, and outliers. Proper data cleaning ensures the accuracy and reliability of the analysis, leading to better insights and decision-making.
In this note, we’ll cover two key aspects of data cleaning: 

**1. Handling missing values** 

**2. Data transformation**


#### **1. Handling Missing Values**
Missing data is a common issue in datasets. Missing values can arise from various reasons such as data collection errors, data entry mistakes, or system issues. If not handled properly, missing data can lead to biased results or errors in the analysis.

**Approaches to Handle Missing Values**

There are several ways to handle missing values, depending on the context and the nature of the data:

##### a. Remove Missing Data

One straightforward method to handle missing values is to remove the rows or columns containing them.

•	**Dropping Rows**: If a dataset has missing values in only a few rows, removing these rows might be a practical solution.

In [11]:
import pandas as pd

# Sample data with missing values
data = {'Name': ['Ade', 'Bola', 'Kola', None, 'Obi', None],
        'Age': [25, 30, None, 40, None, 27],
        'Salary': [50000, None, 70000, None, 65000, None]}
df = pd.DataFrame(data)
df
#df.size()

   Name   Age   Salary
0   Ade  25.0  50000.0
1  Bola  30.0      NaN
2  Kola   NaN  70000.0
3  None  40.0      NaN
4   Obi   NaN  65000.0
5  None  27.0      NaN

In [12]:
# Task 1: Inspect the data for missing values
print("Initial Dataset:")
print(df)
print("\nFrequency table for missing Values:")
print(df.isna().sum())

Initial Dataset:
   Name   Age   Salary
0   Ade  25.0  50000.0
1  Bola  30.0      NaN
2  Kola   NaN  70000.0
3  None  40.0      NaN
4   Obi   NaN  65000.0
5  None  27.0      NaN

Frequency table for missing Values:
Name      2
Age       2
Salary    3
dtype: int64

In [13]:
# Dropping rows with any missing values
df_clean = df.dropna() # drops rows with missing values 
print(df_clean)

  Name   Age   Salary
0  Ade  25.0  50000.0

In [14]:
import seaborn as sns

# Load Titanic dataset
titanic = sns.load_dataset("titanic")

# Show first rows
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [15]:
import seaborn as sns
import pandas as pd

# Load Titanic dataset
titanic = sns.load_dataset("titanic")

# Save to CSV
titanic.to_csv("datasets/titanic/titanic.csv", index=False)

print("Titanic dataset saved as titanic_dataset.csv")

Titanic dataset saved as titanic_dataset.csv

In [16]:
import pandas as pd

# Load Titanic dataset
train = pd.read_csv("datasets/titanic/train.csv")
test = pd.read_csv("datasets/titanic/test.csv")

print(train.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [17]:
# Reading a CSV file with missing values
import pandas as pd
df1 = pd.read_csv('datasets/titanic/titanic.csv')
print(df1)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [18]:
# Task 1: Inspect the data for missing values
#print("Initial Dataset:")
#print(df1)
print("\nFrequency table for missing Values in titanic data:")
print(df1.isna().sum()) # code to know number of missing values per column

Frequency table for missing Values in titanic data:
survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

•	**Dropping Columns:** If a column has too many missing values and is not crucial for analysis, it might be better to drop the entire column.

In [19]:
# Dropping columns with any missing values
df_clean = df.dropna(axis=1) # drops columns with missing value
print(df_clean)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [20]:
# Dropping columns with any missing values
df1_clean = df1.dropna(axis=1) # drops columns with missing value
print(df1_clean)

     survived  pclass     sex  sibsp  parch     fare   class    who  \
0           0       3    male      1      0   7.2500   Third    man
1           1       1  female      1      0  71.2833   First  woman
2           1       3  female      0      0   7.9250   Third  woman
3           1       1  female      1      0  53.1000   First  woman
4           0       3    male      0      0   8.0500   Third    man
..        ...     ...     ...    ...    ...      ...     ...    ...
886         0       2    male      0      0  13.0000  Second    man
887         1       1  female      0      0  30.0000   First  woman
888         0       3  female      1      2  23.4500   Third  woman
889         1       1    male      0      0  30.0000   First    man
890         0       3    male      0      0   7.7500   Third    man

     adult_male alive  alone
0          True    no  False
1         False   yes  False
2         False   yes   True
3         False   yes  False
4          True    no   True
..          ...   ...    ...
886        True    no   True
887       False   yes   True
888       False    no  False
889        True   yes   True
890        True    no   True

[891 rows x 11 columns]

##### b. Imputation (Filling Missing Data)
Instead of dropping data, missing values can be filled or “imputed” with plausible values. Some common imputation techniques include:

**1.	Fill with a constant value:** You can replace missing values with a specific constant like 0 or Unknown (for categorical data).

In [21]:
# Filling missing values with a specific constant (e.g., 0)
df_filled = df.fillna(0)
print(df_filled)

   Name   Age   Salary
0   Ade  25.0  50000.0
1  Bola  30.0      0.0
2  Kola   0.0  70000.0
3     0  40.0      0.0
4   Obi   0.0  65000.0
5     0  27.0      0.0

**2. Fill with the mean/median/mode:** For numerical data, missing values can be filled with statistical measures like the mean, median, or mode of the respective column.

In [22]:
# Filling missing values with the mean of the column
df['Age'] = df['Age'].fillna(df['Age'].mean())
print(df)

   Name   Age   Salary
0   Ade  25.0  50000.0
1  Bola  30.0      NaN
2  Kola  30.5  70000.0
3  None  40.0      NaN
4   Obi  30.5  65000.0
5  None  27.0      NaN

In [23]:
# Filling missing values with the mean of the column
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
print(df)

   Name   Age        Salary
0   Ade  25.0  50000.000000
1  Bola  30.0  61666.666667
2  Kola  30.5  70000.000000
3  None  40.0  61666.666667
4   Obi  30.5  65000.000000
5  None  27.0  61666.666667

**3.	Forward fill or backward fill:** For time series data, missing values can be filled using the last known value (forward fill) or the next known value (backward fill).

In [24]:
# Forward fill
df_filled_ffill = df.fillna(method='ffill')
print(df_filled_ffill)

   Name   Age        Salary
0   Ade  25.0  50000.000000
1  Bola  30.0  61666.666667
2  Kola  30.5  70000.000000
3  Kola  40.0  61666.666667
4   Obi  30.5  65000.000000
5   Obi  27.0  61666.666667

C:\Users\DR  AJAO\AppData\Local\Temp\ipykernel_16476\2825471144.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df.fillna(method='ffill')

In [25]:
# Sample data with missing values
data2 = {'Name': ['Olu', 'Bola', 'Charles', None],
        'Age': [45, 37, None, 40],
        'Salary': [50000, 40000, 60000, None]}
df2 = pd.DataFrame(data2)
df2

      Name   Age   Salary
0      Olu  45.0  50000.0
1     Bola  37.0  40000.0
2  Charles   NaN  60000.0
3     None  40.0      NaN

##### c. Interpolate Missing Values
Interpolation is a more advanced technique where missing values are estimated based on patterns in the data. Pandas provides an **`interpolate()`** function for this purpose.

In [26]:
# Interpolating missing values
df2_interpolated = df2.interpolate()
print(df2_interpolated)

      Name   Age   Salary
0      Olu  45.0  50000.0
1     Bola  37.0  40000.0
2  Charles  38.5  60000.0
3     None  40.0  60000.0

C:\Users\DR  AJAO\AppData\Local\Temp\ipykernel_16476\1871875028.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df2_interpolated = df2.interpolate()

This method is particularly useful for filling gaps in time series data.

##### d. Flag and Model Missing Data

In cases where data is missing in a non-random way (i.e., it could affect the outcome of the analysis), it might be useful to:

**1.	Flag the missing values:** Create a new column that flags whether the data was missing or not.

**2.	Model missing data:** If there’s a pattern to missing data, you can use machine learning models to predict and fill missing values.

In [27]:
# Flagging missing values
df['Age_missing'] = df['Age'].isnull()
print(df)

   Name   Age        Salary  Age_missing
0   Ade  25.0  50000.000000        False
1  Bola  30.0  61666.666667        False
2  Kola  30.5  70000.000000        False
3  None  40.0  61666.666667        False
4   Obi  30.5  65000.000000        False
5  None  27.0  61666.666667        False

### 2. Data Transformation
Data transformation involves changing the format, structure, or values of the data to make it more suitable for analysis. It can include scaling, encoding, or normalizing the data to make it compatible with machine learning algorithms.
##### a. Scaling Data
In some cases, the range of data values can differ widely, which may cause issues in algorithms that are sensitive to the scale of input data (e.g., linear regression, k-nearest neighbors, or neural networks). Scaling ensures that each feature contributes equally to the analysis.

**•	Standardization (Z-score normalization):** Rescales data to have a mean of 0 and a standard deviation of 1.

In [28]:
from sklearn.preprocessing import StandardScaler
# Example DataFrame
data = {'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

# Standardizing the data
scaler = StandardScaler()
scaled_data = scaler.fit_transform(df)
scaled_df = pd.DataFrame(scaled_data, columns=df.columns)
print(scaled_df)

ModuleNotFoundError: No module named 'sklearn'

**•	Min-Max Scaling (Normalization):** Rescales data to a fixed range, typically [0, 1].

In [ ]:
from sklearn.preprocessing import MinMaxScaler

# Normalizing the data
scaler = MinMaxScaler()
normalized_data = scaler.fit_transform(df)
normalized_df = pd.DataFrame(normalized_data, columns=df.columns)
print(normalized_df)

        Age    Salary
0  0.000000  0.000000
1  0.333333  0.333333
2  0.666667  0.666667
3  1.000000  1.000000

##### b. Encoding Categorical Variables
Many machine learning algorithms require numerical inputs. Hence, categorical data must be converted into numerical values. This can be done using techniques like:

**•	Label Encoding:** Each unique category is assigned an integer.

In [ ]:
from sklearn.preprocessing import LabelEncoder

# Sample data with categorical values
df = pd.DataFrame({'City': ['Lagos', 'Port Harcout', 'Ibadan', 'Kaduna']})

# Encoding the 'City' column
encoder = LabelEncoder()
df['City_encoded'] = encoder.fit_transform(df['City']) # this can be referred to as code book for city
print(df)

           City  City_encoded
0         Lagos             2
1  Port Harcout             3
2        Ibadan             0
3        Kaduna             1

##### c. Log Transformation
Log transformation is useful when dealing with highly skewed data. By applying the logarithm to the data, you can reduce the skewness and bring the data closer to a normal distribution.

In [ ]:
import numpy as np

# Applying log transformation to 'Salary' column
df['Salary_log'] = np.log(df['Salary'])
print(df)

   Name   Age   Salary  Salary_log
0   Ade  25.0  50000.0   10.819778
1  Bola  30.0      NaN         NaN
2  Kola   NaN  70000.0   11.156251
3  None  40.0      NaN         NaN
4   Obi   NaN  65000.0   11.082143
5  None  27.0      NaN         NaN

##### d. Binning/Discretization
Binning or discretization involves converting continuous data into discrete intervals or bins. This can simplify models and help detect patterns in certain types of data.

In [ ]:
# Binning the 'Age' column into categories
interval = [0, 18, 35, 60]
category = ['Child', 'Young Adult', 'Adult']
df['Age_group'] = pd.cut(df['Age'], bins=interval, labels=category)
print(df)

   Name   Age   Salary  Salary_log    Age_group
0   Ade  25.0  50000.0   10.819778  Young Adult
1  Bola  30.0      NaN         NaN  Young Adult
2  Kola   NaN  70000.0   11.156251          NaN
3  None  40.0      NaN         NaN        Adult
4   Obi   NaN  65000.0   11.082143          NaN
5  None  27.0      NaN         NaN  Young Adult

Here's a breakdown of the code:

1. **Define Bins**:
   ```python
   bins = [0, 18, 35, 60]
   ```
   - This line defines the age ranges to group (or "bin") the values in the `Age` column.
   - The intervals are:
     - `0-18`
     - `18-35`
     - `35-60`

2. **Define Labels**:
   ```python
   category = ['Child', 'Young Adult', 'Adult']
   ```
   - This list defines the category labels corresponding to each age range.
   - Each label will be assigned based on which bin a particular age falls into:
     - `0-18` will be labeled as `Child`
     - `18-35` will be labeled as `Young Adult`
     - `35-60` will be labeled as `Adult`

3. **Binning the 'Age' Column**:
   ```python
   df['Age_group'] = pd.cut(df['Age'], bins=interval, labels=category)
   ```
   - This line creates a new column, `Age_group`, in the `df` DataFrame.
   - `pd.cut()` is used to segment and categorize the `Age` column into the specified bins.
   - The new `Age_group` column will contain the corresponding label for each age based on the bin it falls into.